app/Controllers/CarritoController.php

SELECT *
FROM `usuario`
WHERE `usuario`.`id_usuario` = '18'
---
    public function carrito()
    {
        $cart = \Config\Services::cart();
        $session = session();

        $usuario = null;

        if ($session->has('id_usuario')) {
            $userModel = new \App\Models\UserModel();
            $usuario = $userModel->find($session->get('id_usuario'));

SELECT *
FROM `producto`
WHERE `producto`.`id_producto` = '5'
---
    public function add_carrito()
    {
        $cart = \Config\Services::cart();
        $request = \Config\Services::request();

        $productoModel = new ProductoModel();
        $idProducto = $request->getPost('id_producto');

        // Obtener producto desde BD
        $producto = $productoModel->find($idProducto);