app/Controllers/ConsultaController.php

    public function leido($id = null)
    {
        $consulta = new ConsultaModel();
        $consultaData = $consulta->find($id);

        if (!$consultaData) {
            return redirect()->to('lista_consulta')
                ->with('mensaje', 'Consulta no encontrada.');
        }

        // Bloquear para consultas de usuarios NO registrados
        if (!isset($consultaData['id_usuario']) || $consultaData['id_usuario'] === null) {
            return redirect()->to('lista_consulta')
                ->with('mensaje', 'No se puede modificar el estado: el remitente no está registrado.');
        }

        // Si ya fue respondida, no se puede cambiar estado
        if (!empty($consultaData['respuesta_consulta'])) {
            return redirect()->to('lista_consulta')
                ->with('mensaje', 'No se puede cambiar el estado: la consulta ya fue respondida.');
        }

        // Cambiar estado normalmente
        $estado = $consultaData['leido_consulta'] == 0 ? 1 : 0;
        $consulta->update($id, ['leido_consulta' => $estado]);
---
SELECT *
FROM `consulta`
UPDATE `consulta` SET `leido_consulta` = 1
WHERE `consulta`.`id_consulta` IN ('1')