app/Controllers/Home.php

SELECT *
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
ORDER BY `producto`.`id_producto` DESC
 LIMIT 3
SELECT `producto`.*, `categoria`.`nombre_categoria`
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
ORDER BY `vendidos_producto` DESC
 LIMIT 2
---
    public function index()
    {

        $productoModel = new ProductoModel();

        // Recuperar los últimos productos con su categoría
        $ultimosProductos = $productoModel->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
            ->orderBy('producto.id_producto', 'DESC')
            ->limit(3)
            ->findAll();

        // Recuperar los dos productos mas vendidos
        $vendidosProductos = $productoModel->select('producto.*, categoria.nombre_categoria')
            ->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
            ->orderBy('vendidos_producto', 'desc')
            ->limit(2)
            ->findAll();