app/Controllers/PedidoController.php

    public function ver_detalles($id_pedido)
    {
        $ventas = new PedidoModel();
        $ventasDetalle = new PedidoDetalleModel();

        // Obtener datos de la venta, del cliente y del medio de pago
        $data['compras'] = $ventas->where('id_pedido', $id_pedido)
                        ->join('usuario', 'usuario.id_usuario = pedido.id_cliente')
                        ->first();

        // Obtener detalles de la venta y productos
        $data['compra_detalles'] = $ventasDetalle->where('id_pedido', $id_pedido)
                    ->join('producto', 'producto.id_producto = pedido_detalle.id_producto')
                    ->findAll();
---
SELECT *
FROM `pedido`
JOIN `usuario` ON `usuario`.`id_usuario` = `pedido`.`id_cliente`
WHERE `id_pedido` = '45'
 LIMIT 1
SELECT *
FROM `pedido_detalle`
JOIN `producto` ON `producto`.`id_producto` = `pedido_detalle`.`id_producto`
WHERE `id_pedido` = '45'

    public function ver_compras($id_usuario)
    {
        $pedidoModel = new PedidoModel();
        $detalleVentaModel = new PedidoDetalleModel();

        $data = $pedidoModel->join('usuario', 'usuario.id_usuario = pedido.id_cliente')->find();
        // Obtener datos de la venta y del cliente
        $compras = $pedidoModel->where('id_cliente', $id_usuario)->findAll();

        // Calculamos el total de cada venta
        foreach ($compras as &$compra) {
            $detalles = $detalleVentaModel->where('id_pedido', $compra['id_pedido'])->findAll();
---
SELECT *
FROM `pedido`
JOIN `usuario` ON `usuario`.`id_usuario` = `pedido`.`id_cliente`
SELECT *
FROM `pedido`
WHERE `id_cliente` = '18'
SELECT *
FROM `pedido_detalle`
WHERE `id_pedido` = '41'

            }

            // CREAR PEDIDO
            $idPedido = $pedidoModel->insert([
                'id_cliente'   => session('id_usuario'),
                'nombre_cliente'       => $request->getPost('nombre'),
                'telefono_cliente'     => $request->getPost('telefono'),
                'dni_cliente'          => $request->getPost('dni'),
                'metodo'       => $request->getPost('metodo'),
                'metodo_pago'  => $request->getPost('metodo_pago'),
                'notas'        => $request->getPost('notas'),
                'fecha_pedido' => date('Y-m-d H:i:s')
            ]);
---
INSERT INTO `pedido` (`id_cliente`, `nombre_cliente`, `telefono_cliente`, `dni_cliente`, `metodo_pago`, `notas`, `fecha_pedido`) VALUES ('18', 'Pietri Troshka', '3791236547', '32456987', 'efectivo', NULL, '2025-12-15 22:18:13')

                    'precio_unitario' => $item['price']
                ]);

                $productoModel->update($item['id'], [
                    'stock_producto' => $nuevoStock
                ]);
---
UPDATE `producto` SET `stock_producto` = 3
WHERE `producto`.`id_producto` IN ('10')

    public function listar_ventas()
    {
        $data['titulo'] = 'Listado de Ventas';

        $ventasModel = new PedidoModel();
        $detalleVentaModel = new PedidoDetalleModel();

        $ventas = $ventasModel->join('usuario', 'usuario.id_usuario = pedido.id_cliente')->findAll();

        // Calculamos el total de cada venta
        foreach ($ventas as &$venta) {
            $detalles = $detalleVentaModel->where('id_pedido', $venta['id_pedido'])->findAll();
---
SELECT *
FROM `pedido`
JOIN `usuario` ON `usuario`.`id_usuario` = `pedido`.`id_cliente`
SELECT *
FROM `pedido`
WHERE `pedido`.`id_pedido` = '47'
SELECT *
FROM `pedido_detalle`
WHERE `id_pedido` = '25'