app/Controllers/ProductoController.php

    public function productos($page = 1)
    {
        $producto = new ProductoModel();
        $categoria = new CategoriaModel();

        $limit = 4; // Número de productos por página
        $offset = ($page - 1) * $limit;

        // Obtener el total de productos
        $total_productos = $producto->countAllResults();

        // Obtener los productos con límite y offset para la paginación
        $productos = $producto->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
                              ->join('proveedor', 'proveedor.id_proveedor = producto.proveedor_producto')
                              ->limit($limit, $offset)
                              ->findAll();

        // Obtener todas las categorías
        $categorias = $categoria->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `producto`
SELECT *
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
JOIN `proveedor` ON `proveedor`.`id_proveedor` = `producto`.`proveedor_producto`
 LIMIT 4
SELECT *
FROM `categoria`

    public function buscar()
    {
        $query = $this->request->getGet('q');
        $producto = new ProductoModel();
        $categoria = new CategoriaModel();

        $productos = $producto
            ->select('producto.*, categoria.nombre_categoria')
            ->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
            ->groupStart()
                ->like('producto.nombre_producto', $query)
                ->orLike('categoria.nombre_categoria', $query)
            ->groupEnd()
            ->paginate(4); // Cantidad por página

        $pager = \Config\Services::pager();
        $categorias = $categoria->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
WHERE   (
`producto`.`nombre_producto` LIKE '%PrimeGoods%' ESCAPE '!'
OR  `categoria`.`nombre_categoria` LIKE '%PrimeGoods%' ESCAPE '!'
 )
SELECT `producto`.*, `categoria`.`nombre_categoria`
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
WHERE   (
`producto`.`nombre_producto` LIKE '%PrimeGoods%' ESCAPE '!'
OR  `categoria`.`nombre_categoria` LIKE '%PrimeGoods%' ESCAPE '!'
 )
 LIMIT 4
SELECT *
FROM `categoria`


            $data['titulo'] = "Registrar Producto";
            $data['producto_proveedor'] = $producto_proveedor->findAll();
            $data['producto_categoria'] = $producto_categoria->findAll();
---
SELECT *
FROM `categoria`

    public function gestionar_prod()
    {
        $producto = new ProductoModel();

        // Obtener los productos y pasarlos a la vista
        $productos = $producto->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
                              ->join('proveedor', 'proveedor.id_proveedor = producto.proveedor_producto')
                              ->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
JOIN `proveedor` ON `proveedor`.`id_proveedor` = `producto`.`proveedor_producto`