app/Controllers/ProductoController.php

    public function gestionar_prod()
    {
        $producto = new ProductoModel();

        // Obtener los productos y pasarlos a la vista
        $productos = $producto->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
                              ->join('proveedor', 'proveedor.id_proveedor = producto.proveedor_producto')
                              ->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
JOIN `proveedor` ON `proveedor`.`id_proveedor` = `producto`.`proveedor_producto`

    public function productos($page = 1)
    {
        $producto = new ProductoModel();
        $categoria = new CategoriaModel();

        $limit = 4; // Número de productos por página
        $offset = ($page - 1) * $limit;

        // Obtener el total de productos
        $total_productos = $producto->countAllResults();

        // Obtener los productos con límite y offset para la paginación
        $productos = $producto->join('categoria', 'categoria.id_categoria = producto.categoria_producto')
                              ->join('proveedor', 'proveedor.id_proveedor = producto.proveedor_producto')
                              ->limit($limit, $offset)
                              ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `producto`
SELECT *
FROM `producto`
JOIN `categoria` ON `categoria`.`id_categoria` = `producto`.`categoria_producto`
JOIN `proveedor` ON `proveedor`.`id_proveedor` = `producto`.`proveedor_producto`
 LIMIT 8, 4