app/Controllers/UserController.php

    public function usuario($id_usuario = null)
    {
        $usuario = new UserModel();
        $data['usuario'] = $usuario->find($id_usuario);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id_usuario` = '15'

    public function gestionar_user()
    {
        $usuario = new UserModel();
         $idUsuarioActivo = session('id_usuario'); // ID del usuario logueado

        // Trae todos los usuarios excepto el activo
        $data['clientes'] = $usuario
        ->where('id_usuario !=', $idUsuarioActivo)
        ->findAll();$data['titulo']='Gestionar Usuarios';
---
SELECT *
FROM `usuario`
WHERE `id_usuario` != '1'

public function actualizar_usuario()
{
    $request = \Config\Services::request();
    $usuarioModel = new UserModel();

    $id = $request->getPost('id_usuario');
    $usuarioActual = $usuarioModel->find($id);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id_usuario` = '15'

    }

    // Actualizar los datos del usuario
    $usuarioModel->update($id, $data);
---
UPDATE `usuario` SET `nombre_usuario` = 'Luisa', `apellido_usuario` = 'Caba', `edad_usuario` = '30', `correo_usuario` = 'luisacab@gmail.com', `pass_usuario` = '$2y$10$KjYEQP6XTgvpmIfR7n77hemJCCZPulXG5Y/90ryobkSx9Xr7EuDLG'
WHERE `usuario`.`id_usuario` IN ('15')

    public function iniciar_sesion()
    {
        $session = session();
        // Instanciamos modelo
        $userModel = new UserModel();

        // Obtiene datos del formulario
        $correo = $this->request->getVar('correo_usuario');
        $pass = $this->request->getVar('pass_usuario');

        // Consulta
        $usuario = $userModel->where('correo_usuario', $correo)->first();
---
SELECT *
FROM `usuario`
WHERE `correo_usuario` = 'luisacab@gmail.com'
 LIMIT 1