app/Controllers/UserController.php

    public function iniciar_sesion()
    {
        $session = session();
        // Instanciamos modelo
        $userModel = new UserModel();

        // Obtiene datos del formulario
        $correo = $this->request->getVar('correo_usuario');
        $pass = $this->request->getVar('pass_usuario');

        // Consulta
        $usuario = $userModel->where('correo_usuario', $correo)->first();
---
SELECT *
FROM `usuario`
WHERE `correo_usuario` = 'luisacabe@gmail.com'
 LIMIT 1